app/Controllers/Dosen.php

INSERT INTO `dosen` (`nama_dosen`, `nidn`, `id_prodi`, `id_matkul`) VALUES ('Anggie', '1912345111', 1, 1)
SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = 1
---
    public function create()
    {
        $model = new \App\Models\DosenModel();
        $json = $this->request->getJSON();

        $data = [
            'nama_dosen' => $json->nama_dosen,
            'nidn' => $json->nidn,
            'id_prodi' => $json->id_prodi,
            'id_matkul' => $json->id_matkul,
        ];

        // Insert data dosen
        if ($model->insert($data)) {
            // Mendapatkan nama prodi berdasarkan id_prodi
            $prodiModel = new \App\Models\ProdiModel();
            $prodi = $prodiModel->find($data['id_prodi']);

SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = '3'
---
public function show($id = null)
{
    $model = new DosenModel();
    $data = $model->find($id);

    if ($data) {
        // Ambil nama prodi
        $prodiModel = new \App\Models\ProdiModel();
        $prodi = $prodiModel->find($data['id_prodi']);

SELECT *
FROM `dosen`
---
public function getAll()
{
    $model = new \App\Models\DosenModel();
    $data = $model->findAll();