app/Controllers/Mahasiswa.php

INSERT INTO `mahasiswa` (`npm`, `password`, `nama_mhs`, `kelas`, `id_prodi`) VALUES ('21012370', 'rahasia123', 'Budi Santoso', 'TI-3A', '1')
SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = '1'
---
    public function create()
    {
        $model = new \App\Models\MahasiswaModel();
        $json = $this->request->getJSON();

        $data = [
            'npm' => $json->npm,
            'password' => $json->password,
            'nama_mhs' => $json->nama_mhs,
            'kelas' => $json->kelas,
            'id_prodi' => $json->id_prodi,
        ];

        // Insert data mahasiswa
        if ($model->insert($data)) {
            // Mendapatkan nama prodi setelah data berhasil disimpan
            $prodiModel = new \App\Models\ProdiModel();
            $prodi = $prodiModel->find($data['id_prodi']);

SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = '3'
---
public function show($id = null)
{
    $model = new MahasiswaModel();
    $data = $model->find($id);

    if ($data) {
        // Ambil nama prodi juga
        $prodiModel = new \App\Models\ProdiModel();
        $prodi = $prodiModel->find($data['id_prodi']);

SELECT *
FROM `mahasiswa`
---
public function getAll()
{
    $model = new \App\Models\MahasiswaModel();
    $data = $model->findAll();