app/Controllers/Matkul.php

public function show($id = null)
{
    $model = new MatkulModel();
    $data = $model->find($id);

    if ($data) {
        // Ambil nama prodi
        $prodiModel = new \App\Models\ProdiModel();
        $prodi = $prodiModel->find($data['id_prodi']);
---
SELECT *
FROM `prodi`
WHERE `prodi`.`id_prodi` = '3'