app/Controllers/Penilaian.php

INSERT INTO `penilaian` (`id_prodi`, `id_dosen`, `sks`, `aspek_nilai`, `saran`) VALUES (4, 6, 3, 3, 'Penjelasan lebih detail mengenai materi')
---
    public function create()
    {
        $role = $this->getUserRole();
        if ($role !== 'mahasiswa') {
            return $this->failForbidden('Hanya mahasiswa yang bisa menambahkan penilaian');
        }

        $data = $this->request->getJSON(true); // ambil input sebagai array

        if (
            empty($data['id_prodi']) ||
            empty($data['id_dosen']) ||
            empty($data['sks']) ||
            empty($data['aspek_nilai'])
        ) {
            return $this->fail('Semua kolom harus diisi');
        }

        $model = new PenilaianModel();
        if ($model->insert($data)) {