app/Controllers/Prodi.php

    public function index()
    {
        $model = new ProdiModel();
        $data = $model->findAll();
---
SELECT *
FROM `prodi`