app/Controllers/Register.php

INSERT INTO `users` (`email`, `password`) VALUES ('septi@gmail.com', '$2y$10$syoeP43MuJiyZNxTVNB6/esZQ7280n8.m2VYR9A5.eT9tNvpoGHCO')
---
        'email'    => $data['email'],
        'password' => password_hash($data['password'], PASSWORD_BCRYPT)
    ];
    $userModel->save($userData);