app/Models/DosenModel.php

SELECT `dosen`.`id_dosen`, `dosen`.`nama_dosen`, `dosen`.`nidn`, `prodi`.`nama_prodi`, `mata_kuliah`.`nama_matkul`
FROM `dosen`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `dosen`.`id_prodi`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_matkul` = `dosen`.`id_matkul`
---
    public function getDosen()
{
    return $this->db->table('dosen')
    ->select('dosen.id_dosen, dosen.nama_dosen, dosen.nidn, prodi.nama_prodi, mata_kuliah.nama_matkul')
    ->join('prodi', 'prodi.id_prodi = dosen.id_prodi', 'left')
    ->join('mata_kuliah', 'mata_kuliah.id_matkul = dosen.id_matkul', 'left')
    ->get()
    ->getResultArray();