app/Models/MahasiswaModel.php

    public function getMahasiswa()
    {
        return $this->db->table($this->table)
            ->select('mahasiswa.id_mhs, mahasiswa.npm, mahasiswa.email, mahasiswa.nama_mhs, mahasiswa.kelas, prodi.nama_prodi')
            ->join('prodi', 'prodi.id_prodi = mahasiswa.id_prodi')
            ->get()
            ->getResultArray();
---
SELECT `mahasiswa`.`id_mhs`, `mahasiswa`.`npm`, `mahasiswa`.`password`, `mahasiswa`.`nama_mhs`, `mahasiswa`.`kelas`, `prodi`.`nama_prodi`
FROM `mahasiswa`
JOIN `prodi` ON `prodi`.`id_prodi` = `mahasiswa`.`id_prodi`