app/Models/PenilaianModel.php

    public function getPenilaian()
{
    return $this->db->table('penilaian')
        ->select('penilaian.id_penilaian, penilaian.sks, penilaian.aspek_nilai, penilaian.saran,
                prodi.nama_prodi, dosen.nama_dosen, mata_kuliah.nama_matkul')
        ->join('prodi', 'prodi.id_prodi = penilaian.id_prodi', 'left')
        ->join('dosen', 'dosen.id_dosen = penilaian.id_dosen', 'left')
        ->get()
        ->getResultArray();
---
SELECT `penilaian`.`id_penilaian`, `penilaian`.`sks`, `penilaian`.`aspek_nilai`, `penilaian`.`saran`, `prodi`.`nama_prodi`, `dosen`.`nama_dosen`
FROM `penilaian`
LEFT JOIN `prodi` ON `prodi`.`id_prodi` = `penilaian`.`id_prodi`
LEFT JOIN `dosen` ON `dosen`.`id_dosen` = `penilaian`.`id_dosen`